```
SELECT 
  select_list 
FROM 
  table_name 
WHERE 
  condition 
ORDER BY 
  sort_expression;
```

![where](./pg_where.png)

In [1]:
import ipynb_importer
%run pg_00_common.ipynb
cursor = pg_connect()

In [2]:
sql = """
SELECT 
  last_name, 
  first_name 
FROM 
  customer 
WHERE 
  first_name = 'Jamie';
"""
run_sql(cursor, sql)

  last_name first_name
0      Rice      Jamie
1     Waugh      Jamie

In [3]:
sql = """
SELECT 
  last_name, 
  first_name 
FROM 
  customer 
WHERE 
  first_name = 'Jamie' 
  AND last_name = 'Rice';
"""
run_sql(cursor, sql)

  last_name first_name
0      Rice      Jamie

In [4]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  last_name = 'Rodriguez' 
  OR first_name = 'Adam';
"""
run_sql(cursor, sql)

  first_name  last_name
0      Laura  Rodriguez
1       Adam      Gooch

In [5]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name IN ('Ann', 'Anne', 'Annie');
"""
run_sql(cursor, sql)

  first_name last_name
0        Ann     Evans
1       Anne    Powell
2      Annie   Russell

In [6]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE 'Ann%';
"""

# % 称为通配符，可以匹配任何字符串。 'Ann%' 模式匹配以 'Ann' 开头的任何字符串 

run_sql(cursor, sql)

  first_name last_name
0       Anna      Hill
1        Ann     Evans
2       Anne    Powell
3      Annie   Russell
4    Annette     Olson

In [7]:
sql = """
SELECT 
  first_name, 
  LENGTH(first_name) name_length 
FROM 
  customer 
WHERE 
  first_name LIKE 'A%' 
  AND LENGTH(first_name) BETWEEN 3 AND 5 
ORDER BY 
  name_length;
"""

run_sql(cursor, sql)

   first_name  name_length
0         Amy            3
1         Ann            3
2         Ana            3
3        Andy            4
4        Anna            4
5        Anne            4
6        Alma            4
7        Adam            4
8        Alan            4
9        Alex            4
10      Angel            5
11      Agnes            5
12      Andre            5
13      Aaron            5
14      Allan            5
15      Allen            5
16      Alice            5
17      Alvin            5
18      Anita            5
19      Amber            5
20      April            5
21      Annie            5

In [8]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE 'Bra%' 
  AND last_name <> 'Motley';
"""

# <> not equal，或者 !=

run_sql(cursor, sql)

  first_name last_name
0     Brandy    Graves
1    Brandon      Huey
2       Brad   Mccurdy